<?php
$str = 'Майкоп;Адыгея
Бор;Алтайский край
Красногорск;Алтайский край
Михайловск;Алтайский край
Новоалтайск;Алтайский край
Рубцовск;Алтайский край
Троицк;Алтайский край
Белогорск;Амурская область
Свободный;Амурская область
Котлас;Архангельская область
Октябрьский;Архангельская область
Белебей;Башкортостан
Белорецк;Башкортостан
Ишим;Башкортостан
Ишимбай;Башкортостан
Кумертау;Башкортостан
Мелеуз;Башкортостан
Михайловка;Башкортостан
Нефтекамск;Башкортостан
Октябрьский;Башкортостан
Салават;Башкортостан
Сибай;Башкортостан
Туймазы;Башкортостан
Бор;Белгородская область
Губкин;Белгородская область
Октябрьский;Белгородская область
Троицк;Белгородская область
Клин;Брянская область
Клинцы;Брянская область
Александров;Владимирская область
Гусь-Хрустальный;Владимирская область
Ковров;Владимирская область
Муром;Владимирская область
Волжск;Волгоградская область
Камышин;Волгоградская область
Михайловка;Волгоградская область
Октябрьский;Волгоградская область
Бор;Вологодская область
Бор;Воронежская область
Борисоглебск;Воронежская область
Лиски;Воронежская область
Россошь;Воронежская область
Буйнакск;Дагестан
Дербент;Дагестан
Избербаш;Дагестан
Каспийск;Дагестан
Хасавюрт;Дагестан
Биробиджан;Еврейская АО
Бор;Забайкальский край
Краснокаменск;Забайкальский край
Кинешма;Ивановская область
Шуя;Ивановская область
Назрань;Ингушетия
Троицк;Ингушетия
Белореченск;Иркутская область
Железногорск;Иркутская область
Железногорск;Иркутская область
Железнодорожный;Иркутская область
Михайловка;Иркутская область
Октябрьский;Иркутская область
Усолье-Сибирское;Иркутская область
Усть-Илимск;Иркутская область
Черемхово;Иркутская область
Прохладный;Кабардино-Балкария
Троицк;Калмыкия
Элиста;Калмыкия
Бор;Калужская область
Обнинск;Калужская область
Чапаевск;Карачаево-Черкесия
Черкесск;Карачаево-Черкесия
Шуя;Карелия
Анжеро-Судженск;Кемеровская область
Белово;Кемеровская область
Белогорск;Кемеровская область
Зеленогорск;Кемеровская область
Красногорск;Кемеровская область
Кузнецк;Кемеровская область
Ленинск-Кузнецкий;Кемеровская область
Междуреченск;Кемеровская область
Юрга;Кемеровская область
Кирово-Чепецк;Кировская область
Воркута;Коми
Троицк;Коми
Ухта;Коми
Бор;Костромская область
Анапа;Краснодарский край
Ейск;Краснодарский край
Азов;Краснодарский край
Александров;Краснодарский край
Белореченск;Краснодарский край
Геленджик;Краснодарский край
Кропоткин;Краснодарский край
Крымск;Краснодарский край
Лабинск;Краснодарский край
Майкоп;Краснодарский край
Михайловск;Краснодарский край
Северск;Краснодарский край
Славянск-на-Кубани;Краснодарский край
Тихорецк;Краснодарский край
Троицк;Краснодарский край
Туапсе;Краснодарский край
Ачинск;Красноярский край
Бор;Красноярский край
Железногорск;Красноярский край
Железногорск;Красноярский край
Зеленогорск;Красноярский край
Канск;Красноярский край
Краснокаменск;Красноярский край
Лесосибирск;Красноярский край
Минусинск;Красноярский край
Назарово;Красноярский край
Октябрьский;Красноярский край
Шали;Красноярский край
Белогорск;Крым
Шадринск;Курганская область
Юрга;Курганская область
Железногорск;Курская область
Железногорск;Курская область
Всеволожск;Ленинградская область
Бор;Ленинградская область
Выборг;Ленинградская область
Гатчина;Ленинградская область
Кириши;Ленинградская область
Павлово;Ленинградская область
Сертолово;Ленинградская область
Сосновый Бор;Ленинградская область
Тихвин;Ленинградская область
Елец;Липецкая область
Бор;Липецкая область
Магадан;Магаданская область
Волжск;Марий Эл
Красногорск;Марий Эл
Березники;Мордовия
Видное;Московская область
Егорьевск;Московская область
Воскресенск;Московская область
Дмитров;Московская область
Долгопрудный;Московская область
Домодедово;Московская область
Дубна;Московская область
Железнодорожный;Московская область
Жуковский;Московская область
Ивантеевка;Московская область
Климовск;Московская область
Клин;Московская область
Коломна;Московская область
Красногорск;Московская область
Лобня;Московская область
Лыткарино;Московская область
Наро-Фоминск;Московская область
Ногинск;Московская область
Одинцово;Московская область
Октябрьский;Московская область
Орехово-Зуево;Московская область
Павловский Посад;Московская область
Пушкино;Московская область
Раменское;Московская область
Реутов;Московская область
Сергиев Посад;Московская область
Серпухов;Московская область
Солнечногорск;Московская область
Ступино;Московская область
Троицк;Московская область
Фрязино;Московская область
Чехов;Московская область
Щёлково;Московская область
Электросталь;Московская область
Апатиты;Мурманская область
Ревда;Мурманская область
Балахна;Нижегородская область
Арзамас;Нижегородская область
Бор;Нижегородская область
Воскресенск;Нижегородская область
Выкса;Нижегородская область
Кстово;Нижегородская область
Павлово;Нижегородская область
Саров;Нижегородская область
Боровичи;Новгородская область
Бор;Новгородская область
Бердск;Новосибирская область
Искитим;Новосибирская область
Азов;Омская область
Ишим;Омская область
Муром;Омская область
Бузулук;Оренбургская область
Александров;Оренбургская область
Новотроицк;Оренбургская область
Дмитров;Орловская область
Заречный;Пензенская область
Кузнецк;Пензенская область
Александров;Пермский край
Березники;Пермский край
Краснокамск;Пермский край
Кунгур;Пермский край
Лысьва;Пермский край
Октябрьский;Пермский край
Соликамск;Пермский край
Чайковский;Пермский край
Александров;Приморский край
Арсеньев;Приморский край
Михайловка;Приморский край
Находка;Приморский край
Новошахтинск;Приморский край
Уссурийск;Приморский край
Великие Луки;Псковская область
Горно-Алтайск;Республика Алтай
Батайск;Ростовская область
Волгодонск;Ростовская область
Азов;Ростовская область
Александров;Ростовская область
Гуково;Ростовская область
Каменск-Шахтинский;Ростовская область
Новошахтинск;Ростовская область
Сальск;Ростовская область
Октябрьский;Рязанская область
Бор;Самарская область
Волжск;Самарская область
Междуреченск;Самарская область
Новокуйбышевск;Самарская область
Чапаевск;Самарская область
Балашов;Саратовская область
Александров;Саратовская область
Вольск;Саратовская область
Ивантеевка;Саратовская область
Бор;Саха (Якутия)
Нерюнгри;Саха (Якутия)
Александров;Сахалинская область
Красногорск;Сахалинская область
Чехов;Сахалинская область
Асбест;Свердловская область
Верхняя Пышма;Свердловская область
Заречный;Свердловская область
Краснотурьинск;Свердловская область
Михайловск;Свердловская область
Новоуральск;Свердловская область
Первоуральск;Свердловская область
Полевской;Свердловская область
Ревда;Свердловская область
Свободный;Свердловская область
Серов;Свердловская область
Троицк;Свердловская область
Михайловск;Северная Осетия
Троицк;Северная Осетия
Вязьма;Смоленская область
Рославль;Смоленская область
Будённовск;Ставропольский край
Ессентуки;Ставропольский край
Александров;Ставропольский край
Бор;Ставропольский край
Георгиевск;Ставропольский край
Кисловодск;Ставропольский край
Минеральные Воды;Ставропольский край
Михайловск;Ставропольский край
Невинномысск;Ставропольский край
Новотроицк;Ставропольский край
Пятигорск;Ставропольский край
Мичуринск;Тамбовская область
Альметьевск;Татарстан
Бугульма;Татарстан
Елабуга;Татарстан
Зеленодольск;Татарстан
Лениногорск;Татарстан
Чистополь;Татарстан
Ржев;Тверская область
Александров;Томская область
Северск;Томская область
Алексин;Тульская область
Арсеньев;Тульская область
Бор;Тульская область
Донской;Тульская область
Дубна;Тульская область
Новомосковск;Тульская область
Октябрьский;Тульская область
Узловая;Тульская область
Кызыл;Тыва
Бор;Тюменская область
Ишим;Тюменская область
Тобольск;Тюменская область
Воткинск;Удмуртия
Глазов;Удмуртия
Красногорск;Удмуртия
Сарапул;Удмуртия
Димитровград;Ульяновская область
Октябрьский;Ульяновская область
Октябрьский;Хабаровский край
Троицк;Хабаровский край
Черногорск;Хакасия
Когалым;Ханты-Мансийский АО
Междуреченск;Ханты-Мансийский АО
Нефтеюганск;Ханты-Мансийский АО
Нягань;Ханты-Мансийский АО
Ханты-Мансийск;Ханты-Мансийский АО
Златоуст;Челябинская область
Копейск;Челябинская область
Красногорск;Челябинская область
Миасс;Челябинская область
Троицк;Челябинская область
Гудермес;Чеченская республика
Урус-Мартан;Чеченская республика
Шали;Чеченская республика
Новочебоксарск;Чувашия
Губкин;Ямало-Ненецкий АО
Новый Уренгой;Ямало-Ненецкий АО
Ноябрьск;Ямало-Ненецкий АО
Бор;Ярославская область
Борисоглебск;Ярославская область';

$arr = explode(PHP_EOL, $str);

$citiesRegions = [];

foreach ($arr as $el) {
  $cityRegion = explode(';', $el);
  $region = $cityRegion[1];
  $city = $cityRegion[0];
  $citiesRegions[$region][] = $city;
}

// echo var_dump($citiesRegions);

?>

<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <title>Document</title>
</head>
<body>
<? foreach ($citiesRegions as $region => $cities) : ?>
  <p><? echo $region; ?></p><ul>
  <? foreach ($cities as $value) : ?>
    <li><? echo $value; ?></li>
  <? endforeach; ?>
  </ul>
<? endforeach; ?>
</body>
</html>
